---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingTopDir2Generic
source: html/bbca8558-ca74-867c-66f8-8a85c716a3f6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingTopDir2Generic Property

"Top/Exterior Minor Spacing"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemSpacingTopDir2Generic { get; }
```